import {T_Resource} from "src/modules/types.ts";

export const ResourceMocks:T_Resource[] = [
    {
        id: 1,
        name: "Железо",
        status: 1,
        image: "",
        description: "Железо - это ковкий переходный металл серебристо-белого цвета с высокой химической реакционной способностью: железо быстро корродирует на воздухе при высоких температурах или при высокой влажности. В чистом кислороде железо горит, а в мелкодисперсном состоянии самовозгорается на воздухе.",
        density: 7.874
    },
    {
        id: 2,
        name: "Кремний",
        status: 1,
        image: "",
        description: "Кремний — второй по распространенности элемент на Земле после кислорода. В свободном виде кремний не встречается, существует только в виде соединений. Кремний химически малоактивен. В реакциях он может проявлять как окислительные, так и восстановительные свойства, восстановительные свойства выражены у него сильнее.",
        density: 2.33
    },
    {
        id: 4,
        name: "Алюминий",
        status: 1,
        image: "",
        description: "Алюминий —легкий и пластичный белый металл, матово-серебристый благодаря тонкой оксидной пленке, которая сразу же покрывает его на воздухе. Он относится к III группе периодической системы, обозначается символом Al, имеет атомный номер 13.",
        density: 2.7
    },
    {
        id: 3,
        name: "Вода",
        status: 1,
        image: "",
        description: "Вода — это жидкость без вкуса, запаха, цвета, которая входит в состав всех живых существ. Вода — это часть неживой природы. Вода содержится в реках, озёрах, болотах, морях и океанах, а также глубоко под землёй. Содержится вода и в атмосфере.",
        density: 1
    }
]